<?php 

 $name = "Raju";
 echo <<<HEREDOC
            $name is a good boy.
            <p>যখন কোনো ডিজাইনার বা ডেভেলপার কোনো ওয়েবসাইটের লেআউট বা ফন্টের স্টাইল দেখাতে চান, কিন্তু সেখানে আসল লেখা বা কন্টেন্ট তখনো তৈরি থাকে না, তখন এই টেক্সটটি ব্যবহার করা হয়। এর মূল উদ্দেশ্য হলো আসল টেক্সটের বদলে একটি সামঞ্জস্যপূর্ণ দৃশ্য তৈরি করা যাতে মানুষের নজর ডিজাইন বা ফরম্যাটিংয়ের দিকে থাকে।</p>
        HEREDOC;

 echo <<<'NOWDOC'
            $name is a good boy.
            <p>যখন কোনো ডিজাইনার বা ডেভেলপার কোনো ওয়েবসাইটের লেআউট বা ফন্টের স্টাইল দেখাতে চান, কিন্তু সেখানে আসল লেখা বা কন্টেন্ট তখনো তৈরি থাকে না, তখন এই টেক্সটটি ব্যবহার করা হয়। এর মূল উদ্দেশ্য হলো আসল টেক্সটের বদলে একটি সামঞ্জস্যপূর্ণ দৃশ্য তৈরি করা যাতে মানুষের নজর ডিজাইন বা ফরম্যাটিংয়ের দিকে থাকে।</p>
        NOWDOC;

?>